
# Задание 4.2
# Преобразовать строку MAC из формата XXXX:XXXX:XXXX в формат XXXX.XXXX.XXXX

MAC = 'AAAA:BBBB:CCCC'

print(MAC.replace(':', '.'))